Revit 2027 API
NumberingSchema.SetScopeDefiningFilterAndOutputParam Method
 Sets the filter and the output parameter that is going to be used by this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetScopeDefiningFilterAndOutputParam(
	ElementId filterId,
	ElementId numberingParameterId
)
Public Sub SetScopeDefiningFilterAndOutputParam (
	filterId As ElementId,
	numberingParameterId As ElementId
)
public:
void SetScopeDefiningFilterAndOutputParam(
	ElementId^ filterId,
	ElementId^ numberingParameterId
)
member SetScopeDefiningFilterAndOutputParam :
        filterId : ElementId *
        numberingParameterId : ElementId -> unit
Parameters
filterId ElementId
 Id for the ParameterFilterElement used to determine the scope for this schema.
numberingParameterId ElementId
 The output parameter for the numbering.
Exceptions
Exception | Condition
ArgumentException |  The given numberingParameterId is not compatible with the filterId provided for this numbering schema.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace